# 레전드 오브 슬래셔 (오단해)

## 목차
-[컨셉](#컨셉)

-[관련 이미지 & 동영상]

-[대표 이미지](#대표-이미지)

# **컨셉**
***
<br>

|컨셉|키워드|설명|
|:---:|:---:|:---:|
|메인 컨셉|**타격감**|계속해서 몰려오는 적들이라는 무쌍류 게임의 특징과 이를 헤쳐나가기 위해 적들을 공격하고 처리하는 과정에서 쉬원한 **타격감**을 느낄 수 있을 거라 생각했다.|
|서브 컨셉 1|**소리**|오감 중 하나인 청각을 이용한 **청각적 효과**로 청각을 자극 시켜준다. 영화나 다른 게임에서도 소리는 중요한 위치를 차지하고 있으며 소리가 없을 경우 얻을 수 있는 느낌이 반감된다. 각각 공격에 맞는 효과음을 넣어 타격감을 증폭 시켜준다. 또한 적이 쓰러지는 효과음으로 적이 쓰러졌음을 인지하여 타격감과 시원한 게임 진행을 느끼게 한다. 또한 무기 종류가 다른 경우 다른 효과음을 넣어 A라는 무기와 B라는 무기의 타격감이 다르게 느낄 수 있도록 만들어준다.|
|서브 컨셉 2|**이펙트**|**시각적 효과**로 오감 중 하나인 시각을 자극시켜주며 청각과 더불어 조화되며 타격감에 대한 느낌을 증폭시켜준다. 약공격에는 작은 이펙트를 넣어주고 강공격에는 큰 이펙트를 넣어주며 필살기에도 필살기에 맞는 이펙트를 넣어준다. 각 공격에 맞는 이펙트를 구현한다.|
|서브 컨셉 3|**필살기**|일반 공격과는 다르게 더 강력하고 넓은 공격 범위로 더 많은 적들을 한꺼번에 처치할 수 있으며 일반 공격과는 다른 타격감을 유저에게 선사할 수 있다. 필살기를 사용하기 위해서는 적을 처치하면 게이지가 차면서 처치하지 못했더라도 주기마다 공격을 했을 경우 게이지가 채워지는 형식으로 구상하고 있다.|
|서브 컨셉 4|**다양한 공격**|아무리 소리와 이펙트가 좋아도 공격이 단순화되면 게임을 진행하는 유저들은 지루함을 느낄 수 있다 생각한다. 먼저 공격 무기 종류를 2가지 종류 (검, 둔기)로 생각하고 있으며 각각 무기에 약공격, 강공격으로 나누고 공격 도중에 필살기를 넣어 자신만에 콤보를 만드는 등 다양한 공격을 할 수 있다.|
|서브 컨셉 5|**몬스터 웨이브**|중간중간에 적이 없는 시간이 있으면 타격감을 느낄 수 있는 시간이 반감될 수 있다고 생각했다. 그래서 적들이 생성될 수 있는 최대 수량을 제한을 하고 짧은 주기로 계속해서 생성하게 만들며 이러한 적들의 생성은 클리어 목표가 달성할 때 까지 지속된다.|


<br><br>

# **관련 이미지 & 동영상**
***

<img src="./img/PlayyShot.jpg">

구상 중인 게임과 유사한 인게임 사진으로 넓은 맵에서 플레이어에게 몰려오는 수많은 적들을 잡으며 진행하는 게임이다.

<img src="./img/PlayShot2.jpg">

<img src="./img/PlayShot3.jpg">

위 사진들과 같이 수많은 적들이 계속해서 몰려오며 플레이어의 hp가 0이 되지 않도록 적을 잡으며 게임을 진행한다. 게임 상의 UI는 HP바, 지도, 필살기 게이지가 구현되며 위 사진과는 UI의 위치가 차이가 있다.

<img src="./img/comboattack.png">

공격은 약공격과 강공격 두 가지로 나뉘어서 이를 조합해서 **다양한 공격**을 할 수 있도록 구상 중이다.

<img src="./img/UI.jpg">

**필살기 게이지** UI는 화면 우측 하단에 위치하여 필살기 사용이 가능한지 여부를 확인할 수 있도록 나타내줍니다.

<br><br>

# **대표 이미지**

<img src="./img/Mainimege.png">

<br><br>

# 컨셉 & 대표이미지 기반 작품묘사

> ### 대표이미지 기반 : 
> ### 컨셉 기반 :

<br><br>

# 레전드 오브 슬래셔 구성 요소

## 1. 메커니즘
도전과제
1. 계속해서 나오는 적을 일정 수량 이상 잡는다.

2. 적들로부터 특정 오브젝트 (동료 NPC 또는 텐트 오브젝트 등)가 부서지지 않도록 지킨다.

3. 적들로부터 일정 시간 동안 살아남는다.

<br>

재미요소
1. 계속해서 나오는 적들을 공격으로 시원시원하게 잡는 시원함을 준다.

2. 일반공격과 강공격, 필살기를 통하여 자신만의 콤보를 만들어 많은 적들을 잡는다.

3. 각 스테이지 마다 클리어 조건이 달라 적극적으로 적을 잡거나 수비적으로 진행해야 하는 등 전략이 달라진다.

4. 무기는 2종류로 자신에게 맞는 무기를 선택하여 플레이가 가능하다.

<br>

## 2. 이야기

만들게 된 배경
일반 공격과 강공격, 필살기로 이루어진 간단한 공격과 키보드 조작 방식으로 쉽게 즐길 수 있으며 자신만의 공격 조합으로 많은 적들을 잡으면서 이 과정에서 느껴지는 시원함과 타격감을 느낄 수 있으면 좋겠다고 생각하였다.

참신함
필살기 게이지는 적을 잡을 때만 차는 것이 아니라 적을 공격했을 경우 일정 게이지가 회복이 가능하다. 이를 통하여 빠르게 필살기 게이지가 채워져서 빠른 재사용으로 시원함을 준다.

카메라 관점
플레이어의 등을 보여주는 3인칭 카메라 관점으로 카메라 회전키로 각 방향에서 접근 해오는 적들을 확인할 수 있게 한다.

<br>

## 3. 미적 요소

디자인 및 컬러
흙과 잔디가 있는 평야에 캐릭터가 위치하며 배경으로는 파란 하늘과 나무, 숲이 보입니다. 스테이지에 따라 밤과 낮을 나누어 어두운 배경과 밝은 배경으로 나누어진다. 캐릭터는 중세시대 기사나 판타지 세계관에서 볼 수 있는 갑옷을 입고 있는 남성형 캐릭터이며 적 캐릭터도 판타지 세계관에서 흔히 보이는 고블린과 오크와 같은 디자인으로 구현한다.

음향
적을 공격했을 경우 생기는 효과음을 만든다. 이 효과음은 무기의 종류에 따라 다르다. 적들의 공격과 피격 소리, 플레이어 캐릭터의 기합 소리와 피격 소리를 구현한다. 일정 수 이상 적을 처치했을 경우 이를 알려주는 감탄 효과음을 넣는다.

<br>

## 4. 기술

현재 자신이 갖고 있는 코딩 지식과 인터넷에서 얻을 수 있는 코딩의 팁과 유니티의 기술을 최대한 활용하여 게임을 구현한다.
